In [11]:
%matplotlib inline
import pandas as pd
import matplotlib.pyplot as plt
import os

In [13]:
city_data_df = pd.read_csv(os.path.join('Resources', 'city_data.csv'))
ride_data_df = pd.read_csv(os.path.join('Resources', 'ride_data.csv'))

In [23]:
city_data_df.head()

           city  driver_count   type
0   Richardfort            38  Urban
1  Williamsstad            59  Urban
2   Port Angela            67  Urban
3    Rodneyfort            34  Urban
4   West Robert            39  Urban

In [24]:
ride_data_df.head()

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4          South Jack  2019-03-06 04:28:35  34.58  3908451377344

In [15]:
city_data_df.count()

city            120
driver_count    120
type            120
dtype: int64

In [16]:
ride_data_df.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [18]:
city_data_df.isnull().sum()

city            0
driver_count    0
type            0
dtype: int64

In [19]:
ride_data_df.isnull().sum()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [21]:
city_data_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [30]:
city_data_df['type'].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [33]:
city_data_df.groupby(['type']).count()[['city']]

          city
type
Rural       18
Suburban    36
Urban       66

In [35]:
ride_data_df.dtypes

city        object
date        object
fare       float64
ride_id      int64
dtype: object

In [40]:
pyber_data_df = pd.merge(ride_data_df, city_data_df, on=['city', 'city'], how='left')

In [41]:
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban